#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.eip_nat[0] will be created
  + resource "aws_eip" "eip_nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "DEV-mwaa"
        }
      + tags_all             = {
          + "Name" = "DEV-mwaa"
        }
      + vpc                  = true
    }

  # aws_eip.eip_nat[1] will be created
  + resource "aws_eip" "eip_nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "DEV-mwaa"
        }
      + tags_all             = {
          + "Name" = "DEV-mwaa"
        }
      + vpc                  = true
    }

  # aws_iam_role.example will be created
  + resource "aws_iam_role" "example" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "airflow.amazonaws.com",
                              + "airflow-env.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "DEV-mwaa-test_role"
        }
      + tags_all              = {
          + "Name" = "DEV-mwaa-test_role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "read-only-secrets-manager"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "secretsmanager:GetResourcePolicy",
                              + "secretsmanager:GetSecretValue",
                              + "secretsmanager:DescribeSecret",
                              + "secretsmanager:ListSecretVersionIds",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      + inline_policy {
          + name   = "s3-access"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "airflow:PublishMetrics"
                          + Effect   = "Allow"
                          + Resource = "arn:aws:airflow:*:*:environment/example"
                        },
                      + {
                          + Action   = "s3:ListAllMyBuckets"
                          + Effect   = "Deny"
                          + Resource = [
                              + "arn:aws:s3:::my-tf-test-bucket-airflow-v1-us-east-1",
                              + "arn:aws:s3:::my-tf-test-bucket-airflow-v1-us-east-1/*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "s3:GetObject*",
                              + "s3:GetBucket*",
                              + "s3:List*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::my-tf-test-bucket-airflow-v1-us-east-1",
                              + "arn:aws:s3:::my-tf-test-bucket-airflow-v1-us-east-1/*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "logs:CreateLogStream",
                              + "logs:CreateLogGroup",
                              + "logs:PutLogEvents",
                              + "logs:GetLogEvents",
                              + "logs:GetLogRecord",
                              + "logs:GetLogGroupFields",
                              + "logs:GetQueryResults",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:logs:*:*:log-group:airflow-example-*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "logs:DescribeLogGroups",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "s3:GetAccountPublicAccessBlock",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                      + {
                          + Action   = "cloudwatch:PutMetricData"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "sqs:ChangeMessageVisibility",
                              + "sqs:DeleteMessage",
                              + "sqs:GetQueueAttributes",
                              + "sqs:GetQueueUrl",
                              + "sqs:ReceiveMessage",
                              + "sqs:SendMessage",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:sqs:*:*:airflow-celery-*"
                        },
                      + {
                          + Action    = [
                              + "kms:Decrypt",
                              + "kms:DescribeKey",
                              + "kms:GenerateDataKey*",
                              + "kms:Encrypt",
                            ]
                          + Condition = {
                              + StringLike = {
                                  + "kms:ViaService" = [
                                      + "sqs.us-east-1.amazonaws.com",
                                    ]
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "arn:aws:kms:*:*:*:key/*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "DEV-mwaa"
        }
      + tags_all = {
          + "Name" = "DEV-mwaa"
        }
      + vpc_id   = (known after apply)
    }

  # aws_mwaa_environment.airflow will be created
  + resource "aws_mwaa_environment" "airflow" {
      + airflow_version                 = "2.2.2"
      + arn                             = (known after apply)
      + created_at                      = (known after apply)
      + dag_s3_path                     = "dags/"
      + environment_class               = (known after apply)
      + execution_role_arn              = (known after apply)
      + id                              = (known after apply)
      + last_updated                    = (known after apply)
      + max_workers                     = 3
      + min_workers                     = 1
      + name                            = "example"
      + plugins_s3_object_version       = (known after apply)
      + requirements_s3_object_version  = (known after apply)
      + schedulers                      = (known after apply)
      + service_role_arn                = (known after apply)
      + source_bucket_arn               = (known after apply)
      + status                          = (known after apply)
      + tags                            = {
          + "Name" = "DEV-mwaa"
        }
      + tags_all                        = {
          + "Name" = "DEV-mwaa"
        }
      + webserver_access_mode           = "PUBLIC_ONLY"
      + webserver_url                   = (known after apply)
      + weekly_maintenance_window_start = (known after apply)

      + logging_configuration {
          + dag_processing_logs {
              + cloud_watch_log_group_arn = (known after apply)
              + enabled                   = true
              + log_level                 = "DEBUG"
            }

          + scheduler_logs {
              + cloud_watch_log_group_arn = (known after apply)
              + enabled                   = true
              + log_level                 = "INFO"
            }

          + task_logs {
              + cloud_watch_log_group_arn = (known after apply)
              + enabled                   = true
              + log_level                 = "WARNING"
            }

          + webserver_logs {
              + cloud_watch_log_group_arn = (known after apply)
              + enabled                   = true
              + log_level                 = "ERROR"
            }

          + worker_logs {
              + cloud_watch_log_group_arn = (known after apply)
              + enabled                   = true
              + log_level                 = "CRITICAL"
            }
        }

      + network_configuration {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
        }
    }

  # aws_nat_gateway.nat_gateway[0] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "DEV-mwaa"
        }
      + tags_all             = {
          + "Name" = "DEV-mwaa"
        }
    }

  # aws_nat_gateway.nat_gateway[1] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "DEV-mwaa"
        }
      + tags_all             = {
          + "Name" = "DEV-mwaa"
        }
    }

  # aws_route.internet_in will be created
  + resource "aws_route" "internet_in" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.nat_route[0] will be created
  + resource "aws_route" "nat_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.nat_route[1] will be created
  + resource "aws_route" "nat_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.nat_route_table[0] will be created
  + resource "aws_route_table" "nat_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "DEV-mwaa-private-nat"
        }
      + tags_all         = {
          + "Name" = "DEV-mwaa-private-nat"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.nat_route_table[1] will be created
  + resource "aws_route_table" "nat_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "DEV-mwaa-private-nat"
        }
      + tags_all         = {
          + "Name" = "DEV-mwaa-private-nat"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_subnet_route_table will be created
  + resource "aws_route_table" "public_subnet_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "DEV-mwaa-public"
        }
      + tags_all         = {
          + "Name" = "DEV-mwaa-public"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.airflow_s3 will be created
  + resource "aws_s3_bucket" "airflow_s3" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-tf-test-bucket-airflow-v1-us-east-1"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "DEV-mwaa-my-tf-test-bucket-airflow-v1-us-east-1"
        }
      + tags_all                    = {
          + "Name" = "DEV-mwaa-my-tf-test-bucket-airflow-v1-us-east-1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_acl.airflow_s3_acl will be created
  + resource "aws_s3_bucket_acl" "airflow_s3_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_public_access_block.airflow_s3_public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "airflow_s3_public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.airflow_s3_versioning will be created
  + resource "aws_s3_bucket_versioning" "airflow_s3_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.main_mwaa will be created
  + resource "aws_security_group" "main_mwaa" {
      + arn                    = (known after apply)
      + description            = "main_mwaa"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "main_mwaa"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "DEV-mwaa"
        }
      + tags_all               = {
          + "Name" = "DEV-mwaa"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "DEV-mwaa-mwaa-vpc-private-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "DEV-mwaa-mwaa-vpc-private-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "DEV-mwaa-mwaa-vpc-private-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "DEV-mwaa-mwaa-vpc-private-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "DEV-mwaa-mwaa-vpc-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "DEV-mwaa-mwaa-vpc-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "DEV-mwaa-mwaa-vpc-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "DEV-mwaa-mwaa-vpc-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "DEV-mwaa"
        }
      + tags_all                             = {
          + "Name" = "DEV-mwaa"
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ashishjullia, Action: `pull_request`*